network : inception
optimizer : adam
classification_type : Y vs D + N
early_stopping : True
Operating System : GNU/Linux
GPU1 : GM107M [GeForce GTX 950M]
GPU2 : HD Graphics 530
CPU(s) : 8
Thread(s) per core : 2
Core(s) per socket : 4
Model name : Intel(R) Core(TM) i7-6700HQ CPU @ 2.60GHz



model_2 : 
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 32, 24, 3)    0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 32, 24, 3)    0                                            
__________________________________________________________________________________________________
model_1 (Model)                 (None, 128)          37922048    input_2[0][0]                    
                                                                 input_3[0][0]                    
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1)            0           model_1[1][0]                    
                                                                 model_1[2][0]                    
==================================================================================================
Total params: 37,922,048
Trainable params: 37,922,048
Non-trainable params: 0
__________________________________________________________________________________________________

model_1 : 
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 24, 3)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 24, 64)   256         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 24, 64)   256         input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 32, 24, 3)    0           input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 24, 64)   36928       conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 24, 64)   102464      conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 24, 64)   256         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 24, 192)  0           conv2d_2[0][0]                   
                                                                 conv2d_4[0][0]                   
                                                                 conv2d_5[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 147456)       0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 256)          37748992    flatten_1[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 128)          32896       dropout_1[0][0]                  
==================================================================================================
Total params: 37,922,048
Trainable params: 37,922,048
Non-trainable params: 0
__________________________________________________________________________________________________

